[
  {
    "id": "859e0e73-3f80-4abd-b621-049c7024059e",
    "title": "DATE COUNTER",
    "subtitle": "FULL STACK WEB APP",
    "link": "https://datecounter.davidkwong.net",
    "technologies": ["REACT", "POSTGRES", "ASP.NET CORE", "DOCKER"],
    "languages": ["C#", "JS/TS"],
    "description": "DATE COUNTER, IS A WEB APPLICATION THAT ALLOWS USERS TO STORE PARTICULAR DATES, THEN IT WILL DISPLAY THE DIFFERENCE IN DAYS BETWEEN TODAY AND THE SELECTED DATES. IT ALLOWS FOR USERS TO CREATE ACCOUNTS AND THERE IS AN OPTION ON EACH \"DATE ITEM\" TO SET AS THE \"COVER CARD\". THE WEB APPLICATION IS BUILT USING CREATE-REACT-APP FETCHING DATA FROM AN ASP.NET CORE WEB API, RETRIEVING FROM A POSTGRES DATABASE. THE FRONT END CREATE-REACT-APP IS HOSTED ON NETLIFY WHILE THE WEB API AND POSTGRES IS DOCKERISED ON HOSTED MYSELF ON A SERVER CONFIGURED WITH A NGINX REVERSE PROXY. ",
    "keywords": [
      "CREATE-REACT-APP",
      "ASP.NET CORE",
      "DOCKER",
      "NGINX",
      "POSTGRES"
    ],
    "imgSrc": "datecounterlogo.svg",
    "color": {
      "primary": "#70919B",
      "text": "#262626",
      "background": "#FFFFFF",
      "textOnPrimary": "#FFFFFF",
      "button": {
        "text": "#FFFFFF",
        "idle": "#70919B",
        "hover": "#8EB8C6",
        "pressed": "#70919B"
      }
    }
  },
  {
    "id": "34e3dd17-09bf-42af-9d5e-edb75a491215",
    "title": "MY 2c ON FAITH",
    "subtitle": "WEBSITE",
    "link": "https://blog.davidkwong.net",
    "technologies": [
      "REACT/NEXT",
      "FAUNADB",
      "NODEJS",
      "DOCKER",
      "N-API",
      "GRAPHQL"
    ],
    "languages": ["JS/TS", "C++"],
    "description": "MY 2C ON FAITH IS A PERSONAL BLOGGING SITE ABOUT MY FAITH AS CHRISTIAN. THE BLOG ALLOWS USERS TO SUBSCRIBE, WHERE THEY WILL RECIEVE AN EMAIL UPON SUBSCRIBING AND WHEN THERE IS NEW CONTENT. I HAVE BUILT THE SITE USING NEXTJS, FETCHING DATA FROM A GRAPHQL NODEJS API, WHICH RELIES ON A FAUNADB DATABASE. I HAVE ALSO ADDED A SMALL N-API ADDON AS A SMALL \"DABBLE\" IN C++ PROJECT WHICH HELPS PARSE A FORMATTED TEXT FILE AND RETURNS THE APPROPIATE JSON WHICH IS THEN STORED IN THE FAUNADB DATABASE. THE FUNCTIONALITY WITH SUBSCRIBERS RECIEVING EMAILS IS PROVIDED BY A SEPERATE NODEJS SERVER, WHICH I UTILISE FOR THE ADMINASTRATIVE TASKS OF MY PERSONAL PROJECTS. THE NEXTJS APPLICATION IS HOSTED ON VERCEL, AND THE NODEJS SERVERS ARE DOCKERISED AND HOSTED MYSELF. ",
    "keywords": ["NEXTJS", "FAUNADB", "NODEJS", "DOCKER", "N-API", "GRAPHQL"],
    "imgSrc": "bloglogo.svg",
    "color": {
      "primary": "#F6F6F6",
      "text": "#F6F6F6",
      "background": "#2C2C2C",
      "textOnPrimary": "#F6F6F6",
      "button": {
        "text": "#F6F6F6",
        "idle": "#4AA9EE",
        "hover": "#69BAF4",
        "pressed": "#4AA9EE"
      }
    }
  },
  {
    "id": "f6831b96-c4f1-434b-930a-5e9be5d262c2",
    "title": "MOOD TRACKER",
    "subtitle": "FULL STACK WEB APP",
    "link": "https://moodtracker.davidkwong.net",
    "technologies": ["FLUTTER", "NODEJS", "SOCKET IO"],
    "languages": ["DART", "JS/TS"],
    "description": "MOODTRACKER IS A WEB APPLICATION THAT ALLOWS FOR USERS TO RECORD THEIR MOODS. USERS WOULD INPUT A SCORE FROM 0-10 AND GIVE AN OPTIONAL REASON FOR WHY THEY ARE FEELING THAT WAY. USERS WILL THEN BE ABLE TO SEE THEIR AVERAGE MOOD SCORES FOR DIFFERENT DURATIONS OF TIME AS WELL AS VIEW INDIVIDUAL LOGS AND SEE WHY THEY FELT THAT WAY. MOODTRACKER ALSO RELIES ON GOOGLE OAUTH2 AND SOCKETIO TO IMPLEMENT A SMOOTH AUTHENTICATION FLOW.",
    "keywords": [],
    "imgSrc": "moodtrackerlogo.svg",
    "color": {
      "primary": "#434332",
      "text": "##434332",
      "background": "#FFFFFF",
      "textOnPrimary": "#FFFFFF",
      "button": {
        "text": "#FFFFFF",
        "idle": "#D96969",
        "hover": "#F57A7A",
        "pressed": "#AB5252"
      }
    }
  }
]
